src/cf/DataProcessors/РедактированиеПанелейРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>РедактированиеПанелейРМК</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/СвойстваЭлементовРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СвойстваЭлементовРМК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РазмерКнопок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦветКнопок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыравниваниеЭлементов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШрифтКнопок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦветШрифта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоложениеЧасов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФигураКнопок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВысотаКнопок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШиринаКнопок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбластьПрименения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереноситьТекст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаголовокКнопки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВеличинаДробногоКоличества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШагДробногоКоличества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодтверждениеДробногоТовара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказыватьСтатусСмены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СценарииИспользованияРМК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СценарииИспользованияРМК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалСамообслуживания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/РедактированиеПанелейРМК/Forms/ФормаРедактированияПанели/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяОбластиСпискаТоваров = НСтр("ru = 'Список товаров'");
	ЭтоНастройкиКнопки = ЭтоРедактированиеКнопкиФормы();
	Если Параметры.Свойство("ЗаголовокОбъекта") Тогда
		ТипОбласти = ?(ЭтоНастройкиКнопки, НСтр("ru = 'Кнопка'"), НСтр("ru = 'Панель'"));
		ЗаголовокОбласти = Параметры.ЗаголовокОбъекта;
		ЭтотОбъект.Заголовок = СтрШаблон("%1 ""%2""", ТипОбласти, Параметры.ЗаголовокОбъекта);
		ЭтоОбластьСпискаТоваров = (ЗаголовокОбласти = ИмяОбластиСпискаТоваров);
	КонецЕсли;
	Если ЭтоНастройкиКнопки И Параметры.Свойство("ИмяЭлемента") Тогда
		ИмяЭлемента = Параметры.ИмяЭлемента;
	КонецЕсли;
	НастроитьВидимостьГруппДляОбласти();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	АктуализироватьДоступностьКнопкиСброса();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РазмерКнопокПриИзменении(Элемент)
	
	УстановитьЗаголовокЭлементаСоЗначением(Элементы.РазмерКнопок, ЗаголовокРазмерКнопок, РазмерКнопок);
	АктуализироватьДоступностьКнопкиСброса();
	
КонецПроцедуры

&НаКлиенте
Процедура ФигураКнопокОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыравниваниеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоложениеЧасовОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветКнопокОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЦветКнопок = Новый Цвет();
	АктуализироватьДоступностьКнопкиСброса();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветШрифтаОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ЦветШрифта = Новый Цвет();
	АктуализироватьДоступностьКнопкиСброса();
	
КонецПроцедуры

&НаКлиенте
Процедура ШрифтКнопокОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ШрифтКнопок = Новый Шрифт();
	АктуализироватьДоступностьКнопкиСброса();
	
КонецПроцедуры

&НаКлиенте
Процедура ЦветКнопокПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ЦветШрифтаПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ШрифтКнопокПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ФигураКнопокПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ВыравниваниеПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ПоложениеЧасовПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаКнопокПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаКнопокПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ОбластьПримененияПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ПереноситьТекстПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ВеличинаДробногоКоличестваПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокКнопкиПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ШагДробногоКоличестваПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

&НаКлиенте
Процедура ПодтверждениеДробногоТовараПриИзменении(Элемент)
	АктуализироватьДоступностьКнопкиСброса();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	Ответ = СформироватьОтвет();
	Закрыть(Ответ);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройки(Команда)
	
	СброситьНастройкиКлиент();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СформироватьОтвет()
	
	РезультатФункции = Новый Структура();
	
	Настройки = Новый Соответствие();
	Для Каждого СтрокаНастройки Из ТаблицаНастроек Цикл
		СвойствоЭлементов = СтрокаНастройки.СвойствоЭлементов;
		ИмяСвойства = ПолучитьИмяЗначенияСвойства(СвойствоЭлементов);
		
		ЗначениеРеквизита = ЭтаФорма[ИмяСвойства];
		ЭтоЦветИлиШрифт = (ТипЗнч(ЗначениеРеквизита) = Тип("Цвет") Или ТипЗнч(ЗначениеРеквизита) = Тип("Шрифт"));
		ЗначениеСвойства = ?(ЭтоЦветИлиШрифт, ОбщегоНазначения.ЗначениеВСтрокуXML(ЗначениеРеквизита), ЗначениеРеквизита);
		
		Настройки.Вставить(СвойствоЭлементов, ЗначениеСвойства);
		
	КонецЦикла;
	РезультатФункции.Вставить("ЗаголовокОбъекта", ЗаголовокОбласти);
	РезультатФункции.Вставить("ИмяЭлемента", ИмяЭлемента);
	РезультатФункции.Вставить("Настройки", Настройки);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Функция ЭтоРедактированиеКнопкиФормы()
	
	РезультатФункции = Ложь;
	ТипРедактируемогоОбъекта = Неопределено;
	Если Параметры.Свойство("ТипОбъекта", ТипРедактируемогоОбъекта) И ТипРедактируемогоОбъекта = Тип("КнопкаФормы") Тогда
		РезультатФункции = Истина;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокЭлементаСоЗначением(ЭлементФормы, ЗаголовокБезЗначения, ЗначениеЭлемента)
	
	ЭлементФормы.Заголовок = СтрШаблон("%1 (%2)", ЗаголовокБезЗначения, Строка(ЗначениеЭлемента));
	
КонецПроцедуры

&НаСервере
Процедура НастроитьГруппуРазмера(НастройкиПоУмолчанию, СвойствоЭлементов, ЗначенияСвойства,
		ЗаголовкиСвойствКнопки, ЗначениеПоУмолчанию)
		
	МаксимальноеЗначение = 1;
		
	ИмяСвойства = ПолучитьИмяЗначенияСвойства(СвойствоЭлементов);
	ИмяГруппы = СтрШаблон("Группа%1", ИмяСвойства);
	Элементы[ИмяГруппы].Видимость = Истина;
	ЭтотОбъект[ИмяСвойства] = ЗначенияСвойства.ЗначениеСвойства;
	ЗначениеПоУмолчанию = ЗначенияСвойства.ЗначениеПоУмолчанию;
	
	Если ЭтоНастройкиКнопки Тогда
		ЗаголовокЭлементаСвойства = ЗаголовкиСвойствКнопки.Получить(СвойствоЭлементов);
		Если Не ЗаголовокЭлементаСвойства = Неопределено Тогда
			Элементы[ИмяСвойства].Заголовок = ЗаголовокЭлементаСвойства;
		КонецЕсли;
	ИначеЕсли ЭтоОбластьСпискаТоваров И СвойствоЭлементов = Перечисления.СвойстваЭлементовРМК.ШиринаКнопок Тогда
		Элементы[ИмяСвойства].Заголовок = НСтр("ru = 'Ширина колонки товара'");
	ИначеЕсли ЭтоОбластьСпискаТоваров И СвойствоЭлементов = Перечисления.СвойстваЭлементовРМК.ВысотаКнопок Тогда
		Элементы[ИмяСвойства].Заголовок = НСтр("ru = 'Ширина колонки сумма'");
	КонецЕсли;

	Если ЭтоНастройкиКнопки Тогда
		МаксимальноеЗначение
			= ИнтерфейсРМКСлужебный.ПолучитьМаксимальноеЗначениеНастройкиЭлемента(ИмяЭлемента, СвойствоЭлементов);
	Иначе
		МаксимальноеЗначение = ПолучитьМаксимальноеЗначениеНастройкиОбластей(НастройкиПоУмолчанию, СвойствоЭлементов);
	КонецЕсли;
	Элементы[ИмяСвойства].МаксимальноеЗначение = МаксимальноеЗначение;
	Если СвойствоЭлементов = Перечисления.СвойстваЭлементовРМК.РазмерКнопок Тогда
		ЗаголовокРазмерКнопок = Элементы[ИмяСвойства].Заголовок;
		УстановитьЗаголовокЭлементаСоЗначением(Элементы.РазмерКнопок, ЗаголовокРазмерКнопок, РазмерКнопок);
	Иначе
		ЗначенияНастройки = Новый Массив;
		Для Счетчик = 0 По МаксимальноеЗначение Цикл
			ЗначенияНастройки.Добавить(Счетчик);
		КонецЦикла;
		Элементы[ИмяСвойства].СписокВыбора.ЗагрузитьЗначения(ЗначенияНастройки);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьГруппуСвойства(СвойствоЭлементов, ЗначенияСвойства, ЗаголовкиСвойствКнопки, ЗначениеПоУмолчанию)
	
	ИмяСвойства = ПолучитьИмяЗначенияСвойства(СвойствоЭлементов);
	ИмяГруппы = СтрШаблон("Группа%1", ИмяСвойства);
	Если ТипЗнч(ЭтотОбъект[ИмяСвойства]) = Тип("Цвет") Или ТипЗнч(ЭтотОбъект[ИмяСвойства]) = Тип("Шрифт") Тогда
		ЭтотОбъект[ИмяСвойства] = ОбщегоНазначения.ЗначениеИзСтрокиXML(ЗначенияСвойства.ЗначениеСвойства);
		ЗначениеПоУмолчанию = ОбщегоНазначения.ЗначениеИзСтрокиXML(ЗначенияСвойства.ЗначениеПоУмолчанию);
	Иначе
		ЭтотОбъект[ИмяСвойства] = ЗначенияСвойства.ЗначениеСвойства;
		ЗначениеПоУмолчанию = ЗначенияСвойства.ЗначениеПоУмолчанию;
	КонецЕсли;
	Элементы[ИмяГруппы].Видимость = Истина;
	Если ЭтоНастройкиКнопки Тогда
		ЗаголовокЭлементаСвойства = ЗаголовкиСвойствКнопки.Получить(СвойствоЭлементов);
		Если Не ЗаголовокЭлементаСвойства = Неопределено Тогда
			Элементы[ИмяСвойства].Заголовок = ЗаголовокЭлементаСвойства;
		КонецЕсли;
	ИначеЕсли ЭтоОбластьСпискаТоваров И СвойствоЭлементов = Перечисления.СвойстваЭлементовРМК.ШрифтКнопок Тогда
		Элементы[ИмяСвойства].Заголовок = НСтр("ru = 'Шрифт'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМаксимальноеЗначениеНастройкиОбластей(НастройкиПоУмолчанию, СвойствоЭлементов)
	
	РезультатФункции = 1;
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("ЗаголовокОбласти", ЗаголовокОбласти);
	ОтборСтрок.Вставить("СвойствоЭлементовОбласти", СвойствоЭлементов);
	СтрокиНастроек = НастройкиПоУмолчанию.НайтиСтроки(ОтборСтрок);
	Если СтрокиНастроек.Количество() > 0 Тогда
		РезультатФункции = СтрокиНастроек[0].МаксимальноеЗначение;
	КонецЕсли;
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
Функция ПолучитьИмяЗначенияСвойства(СвойствоЭлементов)
	
	ИндексПеречисления = Перечисления.СвойстваЭлементовРМК.Индекс(СвойствоЭлементов);
	Возврат Метаданные.Перечисления.СвойстваЭлементовРМК.ЗначенияПеречисления[ИндексПеречисления].Имя;
	
КонецФункции

&НаСервере
Процедура НастроитьВидимостьГруппДляОбласти()
	Перем НастройкиПоУмолчанию;
	
	ЭтоТерминалСамообслуживания = (Параметры.Свойство("СценарийИспользования")
		И Параметры.СценарийИспользования = Перечисления.СценарииИспользованияРМК.ТерминалСамообслуживания);
	Если Параметры.Свойство("Настройки") Тогда
		
		СвойстваРазмеров = Новый Массив;
		СвойстваРазмеров.Добавить(Перечисления.СвойстваЭлементовРМК.РазмерКнопок);
		СвойстваРазмеров.Добавить(Перечисления.СвойстваЭлементовРМК.ВысотаКнопок);
		СвойстваРазмеров.Добавить(Перечисления.СвойстваЭлементовРМК.ШиринаКнопок);
		
		ЗаголовкиСвойствКнопки = Новый Соответствие;
		ЗаголовкиСвойствКнопки.Вставить(Перечисления.СвойстваЭлементовРМК.ЦветКнопок, НСтр("ru = 'Цвет фона'"));
		ЗаголовкиСвойствКнопки.Вставить(Перечисления.СвойстваЭлементовРМК.ШрифтКнопок, НСтр("ru = 'Шрифт'"));
		ЗаголовкиСвойствКнопки.Вставить(Перечисления.СвойстваЭлементовРМК.ФигураКнопок, НСтр("ru = 'Фигура'"));
		ЗаголовкиСвойствКнопки.Вставить(Перечисления.СвойстваЭлементовРМК.ШиринаКнопок, НСтр("ru = 'Ширина'"));
		ЗаголовкиСвойствКнопки.Вставить(Перечисления.СвойстваЭлементовРМК.ВысотаКнопок, НСтр("ru = 'Высота'"));
		ЗаголовкиСвойствКнопки.Вставить(Перечисления.СвойстваЭлементовРМК.РазмерКнопок, НСтр("ru = 'Размер'"));
		
		Если Не ЭтоНастройкиКнопки Тогда
			НастройкиПоУмолчанию = ИнтерфейсРМКСлужебный.ПолучитьПервоначальныеНастройкиОбластейРМК();
		КонецЕсли;
		Для Каждого ДанныеНастройки Из Параметры.Настройки Цикл
			ЗначениеПоУмолчанию = Неопределено;
			ПропускатьНастройку = Ложь;
			Если ДанныеНастройки.Ключ = Перечисления.СвойстваЭлементовРМК.ПоказыватьСтатусСмены
					И ЭтоТерминалСамообслуживания Тогда
				ПропускатьНастройку = Истина;
			ИначеЕсли СвойстваРазмеров.Найти(ДанныеНастройки.Ключ) = Неопределено Тогда
				НастроитьГруппуСвойства(ДанныеНастройки.Ключ, ДанныеНастройки.Значение,
					ЗаголовкиСвойствКнопки, ЗначениеПоУмолчанию);
			Иначе
				НастроитьГруппуРазмера(НастройкиПоУмолчанию, ДанныеНастройки.Ключ, ДанныеНастройки.Значение,
					ЗаголовкиСвойствКнопки, ЗначениеПоУмолчанию);
			КонецЕсли;
			Если Не ПропускатьНастройку Тогда
				НоваяСтрока = ТаблицаНастроек.Добавить();
				НоваяСтрока.СвойствоЭлементов = ДанныеНастройки.Ключ;
				НоваяСтрока.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
				НоваяСтрока.ИмяСвойства = ПолучитьИмяЗначенияСвойства(ДанныеНастройки.Ключ);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьДоступностьКнопкиСброса()
	
	ЕстьРасхождения = Ложь;
	ИндексСтроки = 0;
	Пока ИндексСтроки < ТаблицаНастроек.Количество() И Не ЕстьРасхождения Цикл
		СтрокаНастройки = ТаблицаНастроек.Получить(ИндексСтроки);
		Если Не ЭтотОбъект[СтрокаНастройки.ИмяСвойства] = СтрокаНастройки.ЗначениеПоУмолчанию Тогда
			ЕстьРасхождения = Истина;
		КонецЕсли;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;
	Элементы.ФормаСброситьНастройки.Доступность = ЕстьРасхождения;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНастройкиКлиент()
	
	ОповещениеСброса = Новый ОписаниеОповещения("ВопросСбросНастроекЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru = 'Настройки будут приведены к значениям по умолчанию. Продолжить?'");
	ПоказатьВопрос(ОповещениеСброса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросСбросНастроекЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		Для Каждого СтрокаНастройки Из ТаблицаНастроек Цикл
			ЭтотОбъект[СтрокаНастройки.ИмяСвойства] = СтрокаНастройки.ЗначениеПоУмолчанию;
		КонецЦикла;
		Элементы.ФормаСброситьНастройки.Доступность = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
